# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Pandas and alias it to `pd`.

In [2]:
import pandas as pd

### 2. Create a Pandas Series containing the elements of the list below.

In [ ]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [ ]:
s_lst = pd.Series(lst)

### 3. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [ ]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [ ]:
data_b = pd.DataFrame(data=b)

### 4. Rename the data frame columns based on the names in the list below.

In [ ]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [ ]:
data_b.columns = colnames

# old solution
#colrename = {i: colnames[i] for i in range(len(colnames))}
#data_b = data_b.rename(columns=colrename)

### 5. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [ ]:
data_b135 = data_b[['Score_1', 'Score_3', 'Score_5']]

### 6. From the original data frame, calculate the average, the median and the maximum Score_3 value.

In [ ]:
print(data_b['Score_3'].mean())
print(data_b['Score_3'].median())
print(data_b['Score_3'].max())

### 7. Create a Pandas DataFrame from the dictionary of product orders below.

In [ ]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [ ]:
order_data = pd.DataFrame(orders)
order_data

### 8. Calculate the total quantity ordered and revenue generated from these orders.

In [ ]:
print('Total order quantity: ', order_data['Quantity'].sum())
print('Total revenue: ', order_data['Revenue'].sum())

## Let's load another dataset for more exercises

### 1. Read the three files into python as DataFrames.

In [11]:
data1 = pd.read_csv('files_for_lab/csv_files/file1.csv')
data2 = pd.read_csv('files_for_lab/csv_files/file2.csv')
data3 = pd.read_csv('files_for_lab/csv_files/file3.csv')

Let's evaluate the three datasets by looking at the `head` function.

In [ ]:
print(data1.head())
print(data2.head())
print(data3.head())

### 2. Show the shape of the DataFrames.

In [4]:
print(data1.shape)
print(data2.shape)
print(data3.shape)

(4008, 11)
(996, 11)
(7070, 11)

### 3. Standardize header names of the datasets.

Take in count that you have to remove the spaces in the names. 

**hint**: you can use a loop to save time here.

In [12]:
all_df = [data1, data2, data3]

for data in all_df:
    data.columns = data.columns.str.lower().str.strip().str.replace(' ', '_')
    try:
        data.columns = data.columns.str.replace('state', 'st')
        #data = data.rename(columns={'st':'state'})  didn't work
        #Can you check if it works for you?
    except:
        data.columns
        #data

#Creating a list of all column headers for each dataframe to check if columns are equally named
def sort_col(df):
    colsorted = sorted(df.columns)
    return colsorted

header1sorted = sort_col(data1)
header2sorted = sort_col(data2)
header3sorted = sort_col(data3)

for item in header1sorted:
    if (item not in header2sorted) | (item not in header3sorted):
         print(item, 'is not a column header used in all dataframes')
    else:
        pass

### 4. Rearrange the columns in the dataframe as needed

In [13]:
col1 = list(data1.columns)

data2 = data2[col1]
data3 = data3[col1]

### 5. Concatenate the three DataFrames

In [14]:
data = pd.concat([data1, data2, data3])
data = data.reset_index(drop=True)

### 6. Which columns are numerical? And categorical?

In [15]:
data.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

### 7. In a `markdown` cell, explain briefly the meaning of the columns

### 8. Remove the columns `education` and `Number of Open Complaints` from the DataFrame

In [16]:
data.drop(['education','number_of_open_complaints'], axis=1)

,customer,st,gender,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,23405.98798,71941.0,73.0,Personal Auto,Four-Door Car,198.234764
12070,PK87824,California,F,3096.511217,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000
12071,TD14365,California,M,8163.890428,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
12072,UP19263,California,M,7524.442436,21941.0,96.0,Personal Auto,Four-Door Car,691.200000
12073,Y167826,California,M,2611.836866,0.0,77.0,Corporate Auto,Two-Door Car,369.600000

### 9. Correct the values in the column `Customer Lifetime Value`. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [17]:
data['customer_lifetime_value'] = data['customer_lifetime_value'].str.replace('%', '')
data['customer_lifetime_value'] = pd.to_numeric(data['customer_lifetime_value'], errors='coerce')
data
#I don't understand whats happening here. It looks like all the values that didnt' have a '%' sign turned into NaN.
#What am I doing wrong here?

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,Bachelor,NaN,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
12070,PK87824,California,F,College,NaN,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
12071,TD14365,California,M,Bachelor,NaN,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
12072,UP19263,California,M,College,NaN,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
12073,Y167826,California,M,College,NaN,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

### 10. Remove any duplicate rows after check if there are any

In [ ]:
datadupl = data[data.duplicated()]
duplcustomer = data[data.duplicated(['customer'])]

print(len(datadupl))
print(len(duplcustomer))

if len(datadupl) > 0:
    data = data.drop_duplicates()

### 11. Filter out the data for customers who have an income of 0 or less.

In [ ]:
data.drop(data[data['income'] <= 0].index , inplace=True)

## Bonus

### 1. Count the number of customers by state

In [ ]:
data.groupby(['st']).size()
# or data['st'].value_count()

### 2. What is the average of `claim amount` by gender

In [ ]:
data.groupby(['gender']).mean()

### 3. Select all the rows where the education level is `Bachelor` or higher